@extends('layouts.main')
@section('title', 'ПУБЛИЧНАЯ ОФЕРТА')
@section('content')
    <div class="contact-content">
        <div class="containers">
            <div class="contact-content__block">
                <div class="contact-content__block-back">
                    <a href="#">
                        <svg width="6" height="8" viewBox="0 0 6 8" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M0.126693 4.21814L5.26511 7.90939C5.34597 7.9675 5.45558 8.0001 5.5698 8C5.68403 7.9999 5.79353 7.96713 5.87421 7.90888C5.95488 7.85063 6.00013 7.77168 6 7.6894C5.99987 7.60712 5.95436 7.52825 5.8735 7.47014L1.04088 3.99865L5.8735 0.527157C5.9528 0.468818 5.99696 0.390309 5.99641 0.308663C5.99586 0.227018 5.95064 0.148821 5.87056 0.0910377C5.79048 0.0332541 5.682 0.000545474 5.56866 7.11485e-06C5.45531 -0.000531244 5.34624 0.0311446 5.26511 0.0881619L0.126693 3.77915C0.0865377 3.80795 0.0546745 3.84217 0.0329326 3.87986C0.0111912 3.91755 -6.00308e-07 3.95796 -6.03876e-07 3.99878C-6.07444e-07 4.03959 0.0111912 4.08 0.0329326 4.11769C0.0546745 4.15538 0.0865377 4.18961 0.126693 4.2184L0.126693 4.21814Z" fill="white"/>
                        </svg>

                        <svg width="6" height="8" viewBox="0 0 6 8" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M0.126693 4.21814L5.26511 7.90939C5.34597 7.9675 5.45558 8.0001 5.5698 8C5.68403 7.9999 5.79353 7.96713 5.87421 7.90888C5.95488 7.85063 6.00013 7.77168 6 7.6894C5.99987 7.60712 5.95436 7.52825 5.8735 7.47014L1.04088 3.99865L5.8735 0.527157C5.9528 0.468818 5.99696 0.390309 5.99641 0.308663C5.99586 0.227018 5.95064 0.148821 5.87056 0.0910377C5.79048 0.0332541 5.682 0.000545474 5.56866 7.11485e-06C5.45531 -0.000531244 5.34624 0.0311446 5.26511 0.0881619L0.126693 3.77915C0.0865377 3.80795 0.0546745 3.84217 0.0329326 3.87986C0.0111912 3.91755 -6.00308e-07 3.95796 -6.03876e-07 3.99878C-6.07444e-07 4.03959 0.0111912 4.08 0.0329326 4.11769C0.0546745 4.15538 0.0865377 4.18961 0.126693 4.2184L0.126693 4.21814Z" fill="white"/>
                        </svg>

                    </a>
                </div>
                <div class="contact-content__block-title">ПУБЛИЧНАЯ ОФЕРТА</div>
                <div class="dnew-message__block-list-text">
                    <br><br>
                    Настоящая Политика конфиденциальности персональных данных (далее – Политика конфиденциальности) действует в отношении всей информации, которую сайт https://beehappy24.ru, (далее – www/beehappy24.ru) расположенный на доменном имени beehappy24.ru (а также его субдоменах), может получить о Пользователе во время использования сайта beehappy24.ru (а также его субдоменов), его программ и его продуктов.
                    <br><br>
                    1. Определение терминов<br>
                    1.1 В настоящей Политике конфиденциальности используются следующие термины:
                    <br><br>
                    1.1.1. «Администрация сайта» (далее – Администрация) – уполномоченные сотрудники на управление сайтом https://beehappy24.ru, действующие от имени ООО БИИХЕППИ, которые организуют и (или) осуществляют обработку персональных данных, а также определяет цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными.
                    <br><br>
                    1.1.2. «Персональные данные» - любая информация, относящаяся к прямо или косвенно определенному, или определяемому физическому лицу (субъекту персональных данных).
                    <br><br>
                    1.1.3. «Обработка персональных данных» - любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.
                    <br><br>
                    1.1.4. «Конфиденциальность персональных данных» - обязательное для соблюдения Оператором или иным получившим доступ к персональным данным лицом требование не допускать их распространения без согласия субъекта персональных данных или наличия иного законного основания.
                    <br><br>
                    1.1.5. «Сайт https://beehappy24.ru» - это совокупность связанных между собой веб-страниц, размещенных в сети Интернет по уникальному адресу (URL): beehappy24.ru, а также его субдоменах.
                    <br><br>
                    1.1.6. «Субдомены» - это страницы или совокупность страниц, расположенные на доменах третьего уровня, принадлежащие сайту https://beehappy24.ru, а также другие временные страницы, внизу который указана контактная информация Администрации
                    <br><br>
                    1.1.5. «Пользователь сайта https://beehappy24.ru » (далее Пользователь) – лицо, имеющее доступ к сайту https://beehappy24.ru, посредством сети Интернет и использующее информацию, материалы и продукты сайта https://beehappy24.ru.
                    <br><br>
                    1.1.7. «Cookies» — небольшой фрагмент данных, отправленный веб-сервером и хранимый на компьютере пользователя, который веб-клиент или веб-браузер каждый раз пересылает веб-серверу в HTTP-запросе при попытке открыть страницу соответствующего сайта.
                    <br><br>
                    1.1.8. «IP-адрес» — уникальный сетевой адрес узла в компьютерной сети, через который Пользователь получает доступ на www/beehappy24.ru.
                    <br><br>
                    1.1.9. «Товар » - продукт, который Пользователь заказывает на сайте и оплачивает через платёжные системы.
                    <br><br>
                    2. Общие положения
                    2.1. Использование сайта https://beehappy24.ru Пользователем означает согласие с настоящей Политикой конфиденциальности и условиями обработки персональных данных Пользователя.
                    <br><br>
                    2.2. В случае несогласия с условиями Политики конфиденциальности Пользователь должен прекратить использование сайта https://beehappy24.ru .
                    <br><br>
                    2.3. Настоящая Политика конфиденциальности применяется к сайту https://beehappy24.ru. www/beehappy24.ru не контролирует и не несет ответственность за сайты третьих лиц, на которые Пользователь может перейти по ссылкам, доступным на сайте https://beehappy24.ru.
                    <br><br>
                    2.4. Администрация не проверяет достоверность персональных данных, предоставляемых Пользователем.
                    <br><br>
                    3. Предмет политики конфиденциальности
                    3.1. Настоящая Политика конфиденциальности устанавливает обязательства Администрации по неразглашению и обеспечению режима защиты конфиденциальности персональных данных, которые Пользователь предоставляет по запросу Администрации при регистрации на сайте https://beehappy24.ru, при подписке на информационную e-mail рассылку или при оформлении заказа.
                    <br><br>
                    3.2. Персональные данные, разрешённые к обработке в рамках настоящей Политики конфиденциальности, предоставляются Пользователем путём заполнения форм на сайте https://beehappy24.ru и включают в себя следующую информацию:
                    <br><br>
                    3.2.1. фамилию, имя, отчество Пользователя;
                    <br><br>
                    3.2.2. контактный телефон Пользователя;
                    <br><br>
                    3.2.3. адрес электронной почты (e-mail)
                    <br><br>
                    3.2.4. место жительство Пользователя (при необходимости)
                    <br><br>
                    3.2.5. адрес доставки Товара (при необходимости)
                    <br><br>
                    3.2.6. фотографию (при необходимости).
                    <br><br>
                    3.3. www/beehappy24.ru защищает Данные, которые автоматически передаются при посещении страниц:
                    - IP адрес; <br>
                    - информация из cookies;<br>
                    - информация о браузере<br>
                    - время доступа;<br>
                    - реферер (адрес предыдущей страницы).<br>
                    <br><br>
                    3.3.1. Отключение cookies может повлечь невозможность доступа к частям сайта , требующим авторизации.
                    <br><br>
                    3.3.2. www/beehappy24.ru осуществляет сбор статистики об IP-адресах своих посетителей. Данная информация используется с целью предотвращения, выявления и решения технических проблем.
                    <br><br>
                    3.4. Любая иная персональная информация неоговоренная выше (история посещения, используемые браузеры, операционные системы и т.д.) подлежит надежному хранению и нераспространению, за исключением случаев, предусмотренных в п.п. 5.2. и 5.3. настоящей Политики конфиденциальности.
                    <br><br>
                    4. Цели сбора персональной информации пользователя
                    4.1. Персональные данные Пользователя Администрация может использовать в целях:
                    <br><br>
                    4.1.1. Идентификации Пользователя, зарегистрированного на сайте https://beehappy24.ru для его дальнейшей авторизации, оформления заказа и других действий.
                    <br><br>
                    4.1.2. Предоставления Пользователю доступа к персонализированным данным сайта https://beehappy24.ru.
                    <br><br>
                    4.1.3. Установления с Пользователем обратной связи, включая направление уведомлений, запросов, касающихся использования сайта https://beehappy24.ru, оказания услуг и обработки запросов и заявок от Пользователя.
                    <br><br>
                    4.1.4. Определения места нахождения Пользователя для обеспечения безопасности, предотвращения мошенничества.
                    <br><br>
                    4.1.5. Подтверждения достоверности и полноты персональных данных, предоставленных Пользователем.
                    <br><br>
                    4.1.6. Создания учетной записи для использования частей сайта https://beehappy24.ru, если Пользователь дал согласие на создание учетной записи.
                    <br><br>
                    4.1.7. Уведомления Пользователя по электронной почте.
                    <br><br>
                    4.1.8. Предоставления Пользователю эффективной технической поддержки при возникновении проблем, связанных с использованием сайта https://beehappy24.ru.
                    <br><br>
                    4.1.9. Предоставления Пользователю с его согласия специальных предложений, информации о ценах, новостной рассылки и иных сведений от имени сайта https://beehappy24.ru.
                    <br><br>
                    4.1.10. Осуществления рекламной деятельности с согласия Пользователя.
                    <br><br>
                    5. Способы и сроки обработки персональной информации
                    5.1. Обработка персональных данных Пользователя осуществляется без ограничения срока, любым законным способом, в том числе в информационных системах персональных данных с использованием средств автоматизации или без использования таких средств.
                    <br><br>
                    5.2. Пользователь соглашается с тем, что Администрация вправе передавать персональные данные третьим лицам, в частности, курьерским службам, организациями почтовой связи (в том числе электронной), операторам электросвязи, исключительно в целях выполнения заказа Пользователя, оформленного на сайте https://beehappy24.ru, включая доставку Товара, документации или e-mail сообщений.
                    <br><br>
                    5.3. Персональные данные Пользователя могут быть переданы уполномоченным органам государственной власти Российской Федерации только по основаниям и в порядке, установленным законодательством Российской Федерации.
                    <br><br>
                    5.4. При утрате или разглашении персональных данных Администрация вправе не информировать Пользователя об утрате или разглашении персональных данных.
                    <br><br>
                    5.5. Администрация принимает необходимые организационные и технические меры для защиты персональной информации Пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий третьих лиц.
                    <br><br>
                    5.6. Администрация совместно с Пользователем принимает все необходимые меры по предотвращению убытков или иных отрицательных последствий, вызванных утратой или разглашением персональных данных Пользователя.
                    <br><br>
                    6. Права и обязанности сторон
                    6.1. Пользователь вправе:
                    <br><br>
                    6.1.1. Принимать свободное решение о предоставлении своих персональных данных, необходимых для использования сайта https://beehappy24.ru, и давать согласие на их обработку.
                    <br><br>
                    6.1.2. Обновить, дополнить предоставленную информацию о персональных данных в случае изменения данной информации.
                    <br><br>
                    6.1.3. Пользователь имеет право на получение у Администрации информации, касающейся обработки его персональных данных, если такое право не ограничено в соответствии с федеральными законами. Пользователь вправе требовать от Администрации уточнения его персональных данных, их блокирования или уничтожения в случае, если персональные данные являются неполными, устаревшими, неточными, незаконно полученными или не являются необходимыми для заявленной цели обработки, а также принимать предусмотренные законом меры по защите своих прав.
                    <br><br>
                    6.2. Администрация обязана:
                    <br><br>
                    6.2.1. Использовать полученную информацию исключительно для целей, указанных в п. 4 настоящей Политики конфиденциальности.
                    <br><br>
                    6.2.2. Обеспечить хранение конфиденциальной информации в тайне, не разглашать без предварительного письменного разрешения Пользователя, а также не осуществлять продажу, обмен, опубликование, либо разглашение иными возможными способами переданных персональных данных Пользователя, за исключением п.п. 5.2 и 5.3. настоящей Политики Конфиденциальности.
                    <br><br>
                    6.2.3. Принимать меры предосторожности для защиты конфиденциальности персональных данных Пользователя согласно порядку, обычно используемого для защиты такого рода информации в существующем деловом обороте.
                    <br><br>
                    6.2.4. Осуществить блокирование персональных данных, относящихся к соответствующему Пользователю, с момента обращения или запроса Пользователя, или его законного представителя либо уполномоченного органа по защите прав субъектов персональных данных на период проверки, в случае выявления недостоверных персональных данных или неправомерных действий.
                    <br><br>
                    7. Ответственность сторон
                    7.1. Администрация, не исполнившая свои обязательства, несёт ответственность за убытки, понесённые Пользователем в связи с неправомерным использованием персональных данных, в соответствии с законодательством Российской Федерации, за исключением случаев, предусмотренных п.п. 5.2., 5.3. и 7.2. настоящей Политики Конфиденциальности.
                    <br><br>
                    7.2. В случае утраты или разглашения Конфиденциальной информации Администрация не несёт ответственность, если данная конфиденциальная информация:
                    <br><br>
                    7.2.1. Стала публичным достоянием до её утраты или разглашения.
                    <br><br>
                    7.2.2. Была получена от третьей стороны до момента её получения Администрацией Ресурса.
                    <br><br>
                    7.2.3. Была разглашена с согласия Пользователя.
                    <br><br>
                    7.3. Пользователь несет полную ответственность за соблюдение требований законодательства РФ, в том числе законов о рекламе, о защите авторских и смежных прав, об охране товарных знаков и знаков обслуживания, но не ограничиваясь перечисленным, включая полную ответственность за содержание и форму материалов.
                    <br><br>
                    7.4. Пользователь признает, что ответственность за любую информацию (в том числе, но не ограничиваясь: файлы с данными, тексты и т. д.), к которой он может иметь доступ как к части сайта https://beehappy24.ru, несет лицо, предоставившее такую информацию.
                    <br><br>
                    7.5. Пользователь соглашается, что информация, предоставленная ему как часть сайта https://beehappy24.ru, может являться объектом интеллектуальной собственности, права на который защищены и принадлежат другим Пользователям, партнерам или рекламодателям, которые размещают такую информацию на сайте https://beehappy24.ru. Пользователь не вправе вносить изменения, передавать в аренду, передавать на условиях займа, продавать, распространять или создавать производные работы на основе такого Содержания (полностью или в части), за исключением случаев, когда такие действия были письменно прямо разрешены собственниками такого Содержания в соответствии с условиями отдельного соглашения.
                    <br><br>
                    7.6. В отношение текстовых материалов (статей, публикаций, находящихся в свободном публичном доступе на сайте https://beehappy24.ru) допускается их распространение при условии, что будет дана ссылка на www/beehappy24.ru.
                    <br><br>
                    7.7. Администрация не несет ответственности перед Пользователем за любой убыток или ущерб, понесенный Пользователем в результате удаления, сбоя или невозможности сохранения какого-либо Содержания и иных коммуникационных данных, содержащихся на сайте https://beehappy24.ru или передаваемых через него.
                    <br><br>
                    7.8. Администрация не несет ответственности за любые прямые или косвенные убытки, произошедшие из-за: использования либо невозможности использования сайта, либо отдельных сервисов; несанкционированного доступа к коммуникациям Пользователя; заявления или поведение любого третьего лица на сайте.
                    <br><br>
                    7.9. Администрация не несет ответственность за какую-либо информацию, размещенную пользователем на сайте https://beehappy24.ru, включая, но не ограничиваясь: информацию, защищенную авторским правом, без прямого согласия владельца авторского права.
                    <br><br>
                    8. Разрешение споров
                    8.1. До обращения в суд с иском по спорам, возникающим из отношений между Пользователем и Администрацией, обязательным является предъявление претензии (письменного предложения или предложения в электронном виде о добровольном урегулировании спора).
                    <br><br>
                    8.2. Получатель претензии в течение 30 календарных дней со дня получения претензии, письменно или в электронном виде уведомляет заявителя претензии о результатах рассмотрения претензии.
                    <br><br>
                    8.3. При не достижении соглашения спор будет передан на рассмотрение Арбитражного суда г. Краснодар.
                    <br><br>
                    8.4. К настоящей Политике конфиденциальности и отношениям между Пользователем и Администрацией применяется действующее законодательство Российской Федерации.
                    <br><br>
                    9. Дополнительные условия
                    9.1. Администрация вправе вносить изменения в настоящую Политику конфиденциальности без согласия Пользователя.
                    <br><br>
                    9.2. Новая Политика конфиденциальности вступает в силу с момента ее размещения на сайте https://beehappy24.ru, если иное не предусмотрено новой редакцией Политики конфиденциальности.
                    <br><br>
                    9.3. Все предложения или вопросы касательно настоящей Политики конфиденциальности следует сообщать по адресу: INFO@BEEHAPPY24.RU
                    <br><br>
                    9.4. Действующая Политика конфиденциальности размещена на странице по адресу http://beehappy24.ru/policy Обновлено: 18 Ноября 2019 года
                    <br><br>
                    г. Краснодар, ООО БИИХЕППИ ОГРН 1192375072780
                </div>
            </div>
        </div>
    </div>
@endsection
