@extends('layouts.main')
@section('title', 'Конструктор букетов')
@section('content')
<div class="const-content">
    <button class="const-content__swipe display-n">
        <p>Состав</p>
        <svg width="21" height="11" viewBox="0 0 21 11" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path
                d="M11.0726 10.7677L20.7621 1.3473C20.9147 1.19905 21.0003 0.998111 21 0.788693C20.9997 0.579274 20.9137 0.37853 20.7608 0.230621C20.6079 0.0827128 20.4007 -0.000243992 20.1847 5.03318e-07C19.9687 0.000244999 19.7617 0.0836707 19.6091 0.231925L10.4965 9.09173L1.38379 0.231924C1.23064 0.0865417 1.02456 0.00556997 0.81024 0.00657607C0.595921 0.00758216 0.390654 0.0904849 0.238972 0.237298C0.0872917 0.384112 0.00143049 0.582994 1.71316e-05 0.790797C-0.00139622 0.998601 0.0817527 1.19856 0.231424 1.3473L9.92027 10.7677C9.99586 10.8413 10.0857 10.8998 10.1846 10.9396C10.2836 10.9795 10.3896 11 10.4968 11C10.6039 11 10.71 10.9795 10.8089 10.9396C10.9079 10.8998 10.9977 10.8413 11.0733 10.7677L11.0726 10.7677Z"
                fill="white" />
        </svg>

        <svg width="21" height="11" viewBox="0 0 21 11" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path
                d="M11.0726 10.7677L20.7621 1.3473C20.9147 1.19905 21.0003 0.998111 21 0.788693C20.9997 0.579274 20.9137 0.37853 20.7608 0.230621C20.6079 0.0827128 20.4007 -0.000243992 20.1847 5.03318e-07C19.9687 0.000244999 19.7617 0.0836707 19.6091 0.231925L10.4965 9.09173L1.38379 0.231924C1.23064 0.0865417 1.02456 0.00556997 0.81024 0.00657607C0.595921 0.00758216 0.390654 0.0904849 0.238972 0.237298C0.0872917 0.384112 0.00143049 0.582994 1.71316e-05 0.790797C-0.00139622 0.998601 0.0817527 1.19856 0.231424 1.3473L9.92027 10.7677C9.99586 10.8413 10.0857 10.8998 10.1846 10.9396C10.2836 10.9795 10.3896 11 10.4968 11C10.6039 11 10.71 10.9795 10.8089 10.9396C10.9079 10.8998 10.9977 10.8413 11.0733 10.7677L11.0726 10.7677Z"
                fill="white" />
        </svg>

        <div class="const-content__swipe-media" disabled="disabled">Оформление</div>
    </button>
    <div class="const-content__swipers display-n">
        <div class="const-content__swipers-media-block"></div>
        <div class="const-content__swipers-media-close">Оформление</div>
        <div class="const-content__swipers-media-text">Если вы не выбрали дополнительное оформление ,букет будет собран
            под атласную ленту в подходящей гамме</div>
        <ul class="const-content__swipers-media-lists">
            <li class="const-content__swipers-media-lists-item" id="constMediaBlockSliders_1">
                <svg width="27" height="25" viewBox="0 0 27 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path
                        d="M17.7729 21.1906C17.8169 21.1979 17.8607 21.2015 17.9039 21.2015C18.2836 21.2015 18.6187 20.9273 18.6832 20.5404L19.4742 15.7943C19.546 15.3634 19.255 14.9558 18.824 14.884C18.3931 14.812 17.9855 15.1033 17.9137 15.5342L17.1227 20.2803C17.0509 20.7112 17.342 21.1188 17.7729 21.1906Z"
                        fill="#00F4C8" />
                    <path
                        d="M8.36953 20.5403C8.43402 20.9272 8.7691 21.2014 9.14884 21.2014C9.19203 21.2014 9.2358 21.1979 9.27983 21.1905C9.71078 21.1187 10.0019 20.7112 9.93005 20.2802L9.13903 15.5341C9.06721 15.1032 8.65973 14.8122 8.22873 14.8839C7.79778 14.9557 7.50669 15.3633 7.57851 15.7942L8.36953 20.5403Z"
                        fill="#00F4C8" />
                    <path
                        d="M26.209 8.54491H23.4251L17.3345 0.931651C17.0616 0.590618 16.5639 0.535194 16.2227 0.808147C15.8815 1.08105 15.8262 1.57881 16.0992 1.91995L21.3991 8.54491H5.60087L10.9009 1.91995C11.1738 1.57881 11.1185 1.08099 10.7774 0.808147C10.4362 0.535194 9.93843 0.590565 9.66558 0.931651L3.57492 8.54491H0.791016C0.354164 8.54491 0 8.89908 0 9.33593V12.5C0 12.9368 0.354164 13.291 0.791016 13.291H1.77641L4.77657 23.7915C4.87355 24.1311 5.18395 24.3652 5.53711 24.3652H21.4629C21.8161 24.3652 22.1264 24.1311 22.2235 23.7915L25.2236 13.291H26.209C26.6458 13.291 27 12.9368 27 12.5V9.33593C27 8.89908 26.6458 8.54491 26.209 8.54491ZM20.8663 22.7832H6.13375L3.42172 13.291H23.5783L20.8663 22.7832ZM25.418 11.709C22.7082 11.709 4.14914 11.709 1.58203 11.709V10.1269H25.418V11.709Z"
                        fill="#00F4C8" />
                    <path
                        d="M13.5 21.2012C13.9369 21.2012 14.291 20.847 14.291 20.4102V15.6641C14.291 15.2272 13.9369 14.873 13.5 14.873C13.0631 14.873 12.709 15.2272 12.709 15.6641V20.4102C12.709 20.8471 13.0631 21.2012 13.5 21.2012Z"
                        fill="#00F4C8" />
                </svg>

                <p>На оазисе</p>
            </li>
            <li class="const-content__swipers-media-lists-item" id="constMediaBlockSliders_2">
                <svg width="27" height="25" viewBox="0 0 27 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path
                        d="M17.7729 21.1906C17.8169 21.1979 17.8607 21.2015 17.9039 21.2015C18.2836 21.2015 18.6187 20.9273 18.6832 20.5404L19.4742 15.7943C19.546 15.3634 19.255 14.9558 18.824 14.884C18.3931 14.812 17.9855 15.1033 17.9137 15.5342L17.1227 20.2803C17.0509 20.7112 17.342 21.1188 17.7729 21.1906Z"
                        fill="#00F4C8" />
                    <path
                        d="M8.36953 20.5403C8.43402 20.9272 8.7691 21.2014 9.14884 21.2014C9.19203 21.2014 9.2358 21.1979 9.27983 21.1905C9.71078 21.1187 10.0019 20.7112 9.93005 20.2802L9.13903 15.5341C9.06721 15.1032 8.65973 14.8122 8.22873 14.8839C7.79778 14.9557 7.50669 15.3633 7.57851 15.7942L8.36953 20.5403Z"
                        fill="#00F4C8" />
                    <path
                        d="M26.209 8.54491H23.4251L17.3345 0.931651C17.0616 0.590618 16.5639 0.535194 16.2227 0.808147C15.8815 1.08105 15.8262 1.57881 16.0992 1.91995L21.3991 8.54491H5.60087L10.9009 1.91995C11.1738 1.57881 11.1185 1.08099 10.7774 0.808147C10.4362 0.535194 9.93843 0.590565 9.66558 0.931651L3.57492 8.54491H0.791016C0.354164 8.54491 0 8.89908 0 9.33593V12.5C0 12.9368 0.354164 13.291 0.791016 13.291H1.77641L4.77657 23.7915C4.87355 24.1311 5.18395 24.3652 5.53711 24.3652H21.4629C21.8161 24.3652 22.1264 24.1311 22.2235 23.7915L25.2236 13.291H26.209C26.6458 13.291 27 12.9368 27 12.5V9.33593C27 8.89908 26.6458 8.54491 26.209 8.54491ZM20.8663 22.7832H6.13375L3.42172 13.291H23.5783L20.8663 22.7832ZM25.418 11.709C22.7082 11.709 4.14914 11.709 1.58203 11.709V10.1269H25.418V11.709Z"
                        fill="#00F4C8" />
                    <path
                        d="M13.5 21.2012C13.9369 21.2012 14.291 20.847 14.291 20.4102V15.6641C14.291 15.2272 13.9369 14.873 13.5 14.873C13.0631 14.873 12.709 15.2272 12.709 15.6641V20.4102C12.709 20.8471 13.0631 21.2012 13.5 21.2012Z"
                        fill="#00F4C8" />
                </svg>

                <p>Упаковка</p>
            </li>
            <li class="const-content__swipers-media-lists-item" id="constMediaBlockSliders_3">
                <svg width="27" height="25" viewBox="0 0 27 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path
                        d="M17.7729 21.1906C17.8169 21.1979 17.8607 21.2015 17.9039 21.2015C18.2836 21.2015 18.6187 20.9273 18.6832 20.5404L19.4742 15.7943C19.546 15.3634 19.255 14.9558 18.824 14.884C18.3931 14.812 17.9855 15.1033 17.9137 15.5342L17.1227 20.2803C17.0509 20.7112 17.342 21.1188 17.7729 21.1906Z"
                        fill="#00F4C8" />
                    <path
                        d="M8.36953 20.5403C8.43402 20.9272 8.7691 21.2014 9.14884 21.2014C9.19203 21.2014 9.2358 21.1979 9.27983 21.1905C9.71078 21.1187 10.0019 20.7112 9.93005 20.2802L9.13903 15.5341C9.06721 15.1032 8.65973 14.8122 8.22873 14.8839C7.79778 14.9557 7.50669 15.3633 7.57851 15.7942L8.36953 20.5403Z"
                        fill="#00F4C8" />
                    <path
                        d="M26.209 8.54491H23.4251L17.3345 0.931651C17.0616 0.590618 16.5639 0.535194 16.2227 0.808147C15.8815 1.08105 15.8262 1.57881 16.0992 1.91995L21.3991 8.54491H5.60087L10.9009 1.91995C11.1738 1.57881 11.1185 1.08099 10.7774 0.808147C10.4362 0.535194 9.93843 0.590565 9.66558 0.931651L3.57492 8.54491H0.791016C0.354164 8.54491 0 8.89908 0 9.33593V12.5C0 12.9368 0.354164 13.291 0.791016 13.291H1.77641L4.77657 23.7915C4.87355 24.1311 5.18395 24.3652 5.53711 24.3652H21.4629C21.8161 24.3652 22.1264 24.1311 22.2235 23.7915L25.2236 13.291H26.209C26.6458 13.291 27 12.9368 27 12.5V9.33593C27 8.89908 26.6458 8.54491 26.209 8.54491ZM20.8663 22.7832H6.13375L3.42172 13.291H23.5783L20.8663 22.7832ZM25.418 11.709C22.7082 11.709 4.14914 11.709 1.58203 11.709V10.1269H25.418V11.709Z"
                        fill="#00F4C8" />
                    <path
                        d="M13.5 21.2012C13.9369 21.2012 14.291 20.847 14.291 20.4102V15.6641C14.291 15.2272 13.9369 14.873 13.5 14.873C13.0631 14.873 12.709 15.2272 12.709 15.6641V20.4102C12.709 20.8471 13.0631 21.2012 13.5 21.2012Z"
                        fill="#00F4C8" />
                </svg>

                <p>На оазисе</p>
            </li>
            <li class="const-content__swipers-media-lists-item" id="constMediaBlockSliders_4">
                <svg width="27" height="25" viewBox="0 0 27 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path
                        d="M17.7729 21.1906C17.8169 21.1979 17.8607 21.2015 17.9039 21.2015C18.2836 21.2015 18.6187 20.9273 18.6832 20.5404L19.4742 15.7943C19.546 15.3634 19.255 14.9558 18.824 14.884C18.3931 14.812 17.9855 15.1033 17.9137 15.5342L17.1227 20.2803C17.0509 20.7112 17.342 21.1188 17.7729 21.1906Z"
                        fill="#00F4C8" />
                    <path
                        d="M8.36953 20.5403C8.43402 20.9272 8.7691 21.2014 9.14884 21.2014C9.19203 21.2014 9.2358 21.1979 9.27983 21.1905C9.71078 21.1187 10.0019 20.7112 9.93005 20.2802L9.13903 15.5341C9.06721 15.1032 8.65973 14.8122 8.22873 14.8839C7.79778 14.9557 7.50669 15.3633 7.57851 15.7942L8.36953 20.5403Z"
                        fill="#00F4C8" />
                    <path
                        d="M26.209 8.54491H23.4251L17.3345 0.931651C17.0616 0.590618 16.5639 0.535194 16.2227 0.808147C15.8815 1.08105 15.8262 1.57881 16.0992 1.91995L21.3991 8.54491H5.60087L10.9009 1.91995C11.1738 1.57881 11.1185 1.08099 10.7774 0.808147C10.4362 0.535194 9.93843 0.590565 9.66558 0.931651L3.57492 8.54491H0.791016C0.354164 8.54491 0 8.89908 0 9.33593V12.5C0 12.9368 0.354164 13.291 0.791016 13.291H1.77641L4.77657 23.7915C4.87355 24.1311 5.18395 24.3652 5.53711 24.3652H21.4629C21.8161 24.3652 22.1264 24.1311 22.2235 23.7915L25.2236 13.291H26.209C26.6458 13.291 27 12.9368 27 12.5V9.33593C27 8.89908 26.6458 8.54491 26.209 8.54491ZM20.8663 22.7832H6.13375L3.42172 13.291H23.5783L20.8663 22.7832ZM25.418 11.709C22.7082 11.709 4.14914 11.709 1.58203 11.709V10.1269H25.418V11.709Z"
                        fill="#00F4C8" />
                    <path
                        d="M13.5 21.2012C13.9369 21.2012 14.291 20.847 14.291 20.4102V15.6641C14.291 15.2272 13.9369 14.873 13.5 14.873C13.0631 14.873 12.709 15.2272 12.709 15.6641V20.4102C12.709 20.8471 13.0631 21.2012 13.5 21.2012Z"
                        fill="#00F4C8" />
                </svg>

                <p>Упаковка</p>
            </li>
        </ul>
        <div class="const-content__swipers-media-add">Вы выбрали</div>
        <div class="const-content__swipers-hrm"></div>
        <ul class="const-content__swipers-list">
            <div class="swiper constSwiperListBlock">
                <div class="swiper-wrapper" id="listConstructorElementPay">

                </div>
            </div>
            <div class="swiper-controls">
                <div class="swiper-button-next"></div>
                <div class="swiper-button-prev"></div>
            </div>
        </ul>
        <div class="const-content__swipers-hr"></div>
        <div class="const-content__swipers-price">
            <div class="const-content__swipers-price-description">
                Если вы не выбрали дополнительное оформление ,
                букет будет собран под атласную ленту
                в подходящей гамме
            </div>
            <div class="const-content__swipers-bay">
                <div class="const-content__swipers-bay-price">
                    <div class="const-content__swipers-bay-price-text">Итого:</div>
                    <div class="const-content__swipers-bay-price-sum">0 ₽</div>
                </div>
                <div class="const-content__swipers-bay-count">
                    <div class="const-content__swipers-bay-count-text">Кол-во:</div>
                    <div class="const-content__swipers-bay-price-counts">0 шт.</div>
                </div>
            </div>
            <div class="const-content__swipers-media">
                <div class="const-content__swipers-media-car">
                    <div class="const-content__swipers-media-car-bg"><svg width="16" height="16" viewBox="0 0 16 16"
                            fill="none" xmlns="http://www.w3.org/2000/svg">
                            <g clip-path="url(#clip0_303:5)">
                                <path
                                    d="M4.33317 12.6667H2.99984C2.81584 12.6667 2.6665 12.5173 2.6665 12.3333C2.6665 12.1493 2.81584 12 2.99984 12H4.33317C4.51717 12 4.6665 12.1493 4.6665 12.3333C4.6665 12.5173 4.51717 12.6667 4.33317 12.6667Z"
                                    fill="white" />
                                <path
                                    d="M15.1668 12.667H14.3335C14.1495 12.667 14.0001 12.5177 14.0001 12.3337C14.0001 12.1497 14.1495 12.0003 14.3335 12.0003H14.8901L15.3395 9.60566C15.3335 8.38033 14.2868 7.33366 13.0001 7.33366H10.8115L9.75079 12.0003H11.6668C11.8508 12.0003 12.0001 12.1497 12.0001 12.3337C12.0001 12.5177 11.8508 12.667 11.6668 12.667H9.33345C9.23212 12.667 9.13612 12.621 9.07279 12.5417C9.00945 12.463 8.98545 12.359 9.00812 12.2603L10.2201 6.92699C10.2548 6.77433 10.3895 6.66699 10.5455 6.66699H13.0001C14.6541 6.66699 16.0001 8.01299 16.0001 9.66699L15.4941 12.395C15.4648 12.553 15.3275 12.667 15.1668 12.667Z"
                                    fill="white" />
                                <path
                                    d="M12.9999 14.0003C12.0813 14.0003 11.3333 13.253 11.3333 12.3337C11.3333 11.4143 12.0813 10.667 12.9999 10.667C13.9186 10.667 14.6666 11.4143 14.6666 12.3337C14.6666 13.253 13.9186 14.0003 12.9999 14.0003ZM12.9999 11.3337C12.4486 11.3337 11.9999 11.7823 11.9999 12.3337C11.9999 12.885 12.4486 13.3337 12.9999 13.3337C13.5513 13.3337 13.9999 12.885 13.9999 12.3337C13.9999 11.7823 13.5513 11.3337 12.9999 11.3337Z"
                                    fill="white" />
                                <path
                                    d="M5.66667 14.0003C4.748 14.0003 4 13.253 4 12.3337C4 11.4143 4.748 10.667 5.66667 10.667C6.58533 10.667 7.33333 11.4143 7.33333 12.3337C7.33333 13.253 6.58533 14.0003 5.66667 14.0003ZM5.66667 11.3337C5.11533 11.3337 4.66667 11.7823 4.66667 12.3337C4.66667 12.885 5.11533 13.3337 5.66667 13.3337C6.218 13.3337 6.66667 12.885 6.66667 12.3337C6.66667 11.7823 6.218 11.3337 5.66667 11.3337Z"
                                    fill="white" />
                                <path
                                    d="M4.33325 6.66667H1.66659C1.48259 6.66667 1.33325 6.51733 1.33325 6.33333C1.33325 6.14933 1.48259 6 1.66659 6H4.33325C4.51725 6 4.66658 6.14933 4.66658 6.33333C4.66658 6.51733 4.51725 6.66667 4.33325 6.66667Z"
                                    fill="white" />
                                <path
                                    d="M4.33341 8.66667H1.00008C0.816081 8.66667 0.666748 8.51733 0.666748 8.33333C0.666748 8.14933 0.816081 8 1.00008 8H4.33341C4.51741 8 4.66675 8.14933 4.66675 8.33333C4.66675 8.51733 4.51741 8.66667 4.33341 8.66667Z"
                                    fill="white" />
                                <path
                                    d="M4.33333 10.6667H0.333333C0.149333 10.6667 0 10.5173 0 10.3333C0 10.1493 0.149333 10 0.333333 10H4.33333C4.51733 10 4.66667 10.1493 4.66667 10.3333C4.66667 10.5173 4.51733 10.6667 4.33333 10.6667Z"
                                    fill="white" />
                                <path
                                    d="M9.33317 12.667H6.99984C6.81584 12.667 6.6665 12.5177 6.6665 12.3337C6.6665 12.1497 6.81584 12.0003 6.99984 12.0003H9.06717L10.5818 5.33366H2.99984C2.81584 5.33366 2.6665 5.18433 2.6665 5.00033C2.6665 4.81633 2.81584 4.66699 2.99984 4.66699H10.9998C11.1012 4.66699 11.1972 4.71299 11.2605 4.79233C11.3238 4.87099 11.3478 4.97499 11.3252 5.07366L9.6585 12.407C9.62384 12.5597 9.4885 12.667 9.33317 12.667Z"
                                    fill="white" />
                            </g>
                            <defs>
                                <clipPath id="clip0_303:5">
                                    <rect width="16" height="16" fill="white" />
                                </clipPath>
                            </defs>
                        </svg>
                    </div>
                    <p>Бесплатная доставка по городу</p>
                </div>
                <div class="const-content__swipers-media-list">
                    <div class="const-content__swipers-media-list-bg"><svg width="16" height="16" viewBox="0 0 16 16"
                            fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M5.5 4.5625C5.67249 4.5625 5.8125 4.42249 5.8125 4.25C5.8125 4.07751 5.67249 3.9375 5.5 3.9375C5.32751 3.9375 5.1875 4.07751 5.1875 4.25C5.1875 4.42249 5.32751 4.5625 5.5 4.5625Z"
                                fill="white" />
                            <path
                                d="M5.5 6.4375C5.67249 6.4375 5.8125 6.29749 5.8125 6.125C5.8125 5.95251 5.67249 5.8125 5.5 5.8125C5.32751 5.8125 5.1875 5.95251 5.1875 6.125C5.1875 6.29749 5.32751 6.4375 5.5 6.4375Z"
                                fill="white" />
                            <path
                                d="M4.875 16H12.375C13.5812 16 14.5625 15.0187 14.5625 13.8125C14.5625 13.6399 14.4226 13.5 14.25 13.5H13.3125V1.5625C13.3125 0.700928 12.6116 0 11.75 0C11.75 0 2.75806 0 2.6875 0C1.99829 0 1.4375 0.560791 1.4375 1.25V2.8125C1.4375 2.98511 1.57739 3.125 1.75 3.125H3.3125V14.3706C3.3125 15.2198 3.95898 16 4.875 16ZM12.375 15.375H6.12427C6.3208 15.1136 6.4375 14.7858 6.4375 14.4343V14.1218H13.9061C13.761 14.8342 13.1295 15.375 12.375 15.375ZM12.6875 1.5625V13.5H6.125C5.95239 13.5 5.8125 13.6399 5.8125 13.8125V14.4375C5.8125 14.9545 5.39197 15.375 4.875 15.375C4.3147 15.375 3.9375 14.8901 3.9375 14.3706V1.25C3.9375 1.02466 3.87744 0.810547 3.77039 0.625H11.75C12.267 0.625 12.6875 1.04553 12.6875 1.5625ZM2.0625 2.5V1.25C2.0625 0.905396 2.3429 0.625 2.6875 0.625C3.02917 0.625 3.3125 0.900513 3.3125 1.25V2.5H2.0625Z"
                                fill="white" />
                            <path
                                d="M8.3125 8.9375C8.3125 9.47852 8.53882 9.97876 8.9375 10.334V12.375C8.9375 12.4902 9.00098 12.5962 9.10254 12.6505C9.2041 12.705 9.32751 12.699 9.42334 12.635L10.1875 12.1256L10.9517 12.635C11.0477 12.6991 11.171 12.7048 11.2725 12.6505C11.374 12.5962 11.4375 12.4902 11.4375 12.375V10.334C11.8363 9.97864 12.0625 9.47839 12.0625 8.9375C12.0625 7.90369 11.2214 7.0625 10.1875 7.0625C9.15356 7.0625 8.3125 7.90356 8.3125 8.9375ZM10.3608 11.49C10.2559 11.42 10.1191 11.42 10.0142 11.49L9.5625 11.7911V10.7058C9.76111 10.776 9.97144 10.8125 10.1875 10.8125C10.4036 10.8125 10.6139 10.776 10.8125 10.7058V11.7911L10.3608 11.49ZM11.4375 8.9375C11.4375 9.64294 10.863 10.1875 10.1875 10.1875C9.51172 10.1875 8.9375 9.64331 8.9375 8.9375C8.9375 8.24829 9.49829 7.6875 10.1875 7.6875C10.8767 7.6875 11.4375 8.24829 11.4375 8.9375Z"
                                fill="white" />
                            <path
                                d="M5.5 2.6875H11.125C11.2976 2.6875 11.4375 2.54761 11.4375 2.375C11.4375 2.20239 11.2976 2.0625 11.125 2.0625H5.5C5.32739 2.0625 5.1875 2.20239 5.1875 2.375C5.1875 2.54761 5.32739 2.6875 5.5 2.6875Z"
                                fill="white" />
                            <path
                                d="M6.75 4.5625H11.125C11.2976 4.5625 11.4375 4.42261 11.4375 4.25C11.4375 4.07739 11.2976 3.9375 11.125 3.9375H6.75C6.57739 3.9375 6.4375 4.07739 6.4375 4.25C6.4375 4.42261 6.57739 4.5625 6.75 4.5625Z"
                                fill="white" />
                            <path
                                d="M6.75 6.4375H11.125C11.2976 6.4375 11.4375 6.29761 11.4375 6.125C11.4375 5.95239 11.2976 5.8125 11.125 5.8125H6.75C6.57739 5.8125 6.4375 5.95239 6.4375 6.125C6.4375 6.29761 6.57739 6.4375 6.75 6.4375Z"
                                fill="white" />
                            <path
                                d="M5.5 10.1875H7.375C7.54761 10.1875 7.6875 10.0476 7.6875 9.875C7.6875 9.70239 7.54761 9.5625 7.375 9.5625H5.5C5.32739 9.5625 5.1875 9.70239 5.1875 9.875C5.1875 10.0476 5.32739 10.1875 5.5 10.1875Z"
                                fill="white" />
                            <path
                                d="M5.5 8.3125H7.375C7.54761 8.3125 7.6875 8.17261 7.6875 8C7.6875 7.82739 7.54761 7.6875 7.375 7.6875H5.5C5.32739 7.6875 5.1875 7.82739 5.1875 8C5.1875 8.17261 5.32739 8.3125 5.5 8.3125Z"
                                fill="white" />
                            <path
                                d="M5.5 12.0625H7.375C7.54761 12.0625 7.6875 11.9226 7.6875 11.75C7.6875 11.5774 7.54761 11.4375 7.375 11.4375H5.5C5.32739 11.4375 5.1875 11.5774 5.1875 11.75C5.1875 11.9226 5.32739 12.0625 5.5 12.0625Z"
                                fill="white" />
                        </svg>
                    </div>
                    <p>В случае доставки товара не надлежащего качества сообщите нам и мы его заменим</p>
                </div>
                <div class="const-content__swipers-media-title">
                    Детали цены
                </div>
                <div class="const-content__swipers-media-count">
                    <div class="const-content__swipers-media-count-title">Сумма без учета баллов</div>
                    <div class="const-content__swipers-media-count-line"></div>
                    <div class="const-content__swipers-media-count-price">12 300₽</div>
                </div>
                <div class="const-content__swipers-media-sum">
                    <div class="const-content__swipers-media-sum-title">Кол-во:</div>
                    <div class="const-content__swipers-media-sum-item">345шт. </div>
                </div>
                <div class="const-content__swipers-media-price">
                    <div class="const-content__swipers-media-price-title">Итого:</div>
                    <div class="const-content__swipers-media-price-item">12 622₽</div>
                </div>

            </div>
            <button class="const-content__swipers-price-pay" onclick="submit_form()"><a href="#">Купить
                    сейчас</a></button>
            <button class="const-content__swipers-price-add" onclick="cont_add_to_cart()"><a href="#">Добавить в
                    корзину</a></button>
        </div>
        <div class="const-content__swipers-btn">
            <svg width="21" height="11" viewBox="0 0 21 11" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path
                    d="M9.92737 0.232272L0.237851 9.6527C0.0853058 9.80095 -0.000251483 10.0019 6.59277e-07 10.2113C0.000252802 10.4207 0.0862938 10.6215 0.239196 10.7694C0.392097 10.9173 0.599335 11.0002 0.815319 11C1.0313 10.9998 1.23834 10.9163 1.39088 10.7681L10.5036 1.90827L19.6162 10.7681C19.7694 10.9135 19.9754 10.9944 20.1898 10.9934C20.4041 10.9924 20.6093 10.9095 20.761 10.7627C20.9127 10.6159 20.9986 10.417 21 10.2092C21.0014 10.0014 20.9182 9.80144 20.7686 9.6527L11.0797 0.232272C11.0041 0.158655 10.9143 0.100238 10.8154 0.0603785C10.7164 0.0205188 10.6104 4.37705e-07 10.5032 4.23656e-07C10.3961 4.09607e-07 10.29 0.0205187 10.1911 0.0603785C10.0921 0.100238 10.0023 0.158655 9.9267 0.232272L9.92737 0.232272Z"
                    fill="white" />
            </svg>

            <svg width="21" height="11" viewBox="0 0 21 11" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path
                    d="M9.92737 0.232272L0.237851 9.6527C0.0853058 9.80095 -0.000251483 10.0019 6.59277e-07 10.2113C0.000252802 10.4207 0.0862938 10.6215 0.239196 10.7694C0.392097 10.9173 0.599335 11.0002 0.815319 11C1.0313 10.9998 1.23834 10.9163 1.39088 10.7681L10.5036 1.90827L19.6162 10.7681C19.7694 10.9135 19.9754 10.9944 20.1898 10.9934C20.4041 10.9924 20.6093 10.9095 20.761 10.7627C20.9127 10.6159 20.9986 10.417 21 10.2092C21.0014 10.0014 20.9182 9.80144 20.7686 9.6527L11.0797 0.232272C11.0041 0.158655 10.9143 0.100238 10.8154 0.0603785C10.7164 0.0205188 10.6104 4.37705e-07 10.5032 4.23656e-07C10.3961 4.09607e-07 10.29 0.0205187 10.1911 0.0603785C10.0921 0.100238 10.0023 0.158655 9.9267 0.232272L9.92737 0.232272Z"
                    fill="white" />
            </svg>

            <p class="const-content__swipers-btn-text">Ваш букет</p>
        </div>
    </div>
    <div class="const-content__block">
        <div class="const-content__block-title">Конструтор букетов
            <div class="const-content__block-back">
                <a href="#">
                    <svg width="6" height="8" viewBox="0 0 6 8" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M0.126693 4.21814L5.26511 7.90939C5.34597 7.9675 5.45558 8.0001 5.5698 8C5.68403 7.9999 5.79353 7.96713 5.87421 7.90888C5.95488 7.85063 6.00013 7.77168 6 7.6894C5.99987 7.60712 5.95436 7.52825 5.8735 7.47014L1.04088 3.99865L5.8735 0.527157C5.9528 0.468818 5.99696 0.390309 5.99641 0.308663C5.99586 0.227018 5.95064 0.148821 5.87056 0.0910377C5.79048 0.0332541 5.682 0.000545474 5.56866 7.11485e-06C5.45531 -0.000531244 5.34624 0.0311446 5.26511 0.0881619L0.126693 3.77915C0.0865377 3.80795 0.0546745 3.84217 0.0329326 3.87986C0.0111912 3.91755 -6.00308e-07 3.95796 -6.03876e-07 3.99878C-6.07444e-07 4.03959 0.0111912 4.08 0.0329326 4.11769C0.0546745 4.15538 0.0865377 4.18961 0.126693 4.2184L0.126693 4.21814Z"
                            fill="white" />
                    </svg>

                    <svg width="6" height="8" viewBox="0 0 6 8" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M0.126693 4.21814L5.26511 7.90939C5.34597 7.9675 5.45558 8.0001 5.5698 8C5.68403 7.9999 5.79353 7.96713 5.87421 7.90888C5.95488 7.85063 6.00013 7.77168 6 7.6894C5.99987 7.60712 5.95436 7.52825 5.8735 7.47014L1.04088 3.99865L5.8735 0.527157C5.9528 0.468818 5.99696 0.390309 5.99641 0.308663C5.99586 0.227018 5.95064 0.148821 5.87056 0.0910377C5.79048 0.0332541 5.682 0.000545474 5.56866 7.11485e-06C5.45531 -0.000531244 5.34624 0.0311446 5.26511 0.0881619L0.126693 3.77915C0.0865377 3.80795 0.0546745 3.84217 0.0329326 3.87986C0.0111912 3.91755 -6.00308e-07 3.95796 -6.03876e-07 3.99878C-6.07444e-07 4.03959 0.0111912 4.08 0.0329326 4.11769C0.0546745 4.15538 0.0865377 4.18961 0.126693 4.2184L0.126693 4.21814Z"
                            fill="white" />
                    </svg>

                </a>
            </div>
        </div>
        <div class="const-content__block-text">
            <div class="const-content__block-text-1">1. В связи с загруженным автомобильным трафиком в предпраздничные и
                праздничные дни, а также в связи с большим объемом заказов на пиковые интервалы, возможны задержки в
            </div>
            <div class="const-content__block-text-2">1. В связи с загруженным автомобильным трафиком в предпраздничные и
                праздничные дни, а также в связи с большим объемом заказов на пиковые интервалы, возможны задержки в
            </div>
        </div>
        <div class="const-content__block-banner">
            <ul class="const-content__block-banner-map" id="listConstructorBlock">

            </ul>
        </div>
        <div class="const-content__block-add">Выберите цветы</div>

        {{-- Верхний блок --}}
        <ul class="const-content__block-list">
            @foreach ($catsMain as $cat)
            <li data-id="{{ $cat['id'] }}" class="js-constructor-cat const-content__block-list-item">
                <span><img src="{{ $cat['img'] }}" style="max-width:100%" alt="img"></span>
                <p>{{ $cat['name'] }}</p>
            </li>
            @endforeach
        </ul>
        <div class="const-content__block-add">Оформление</div>
        <ul class="const-content__block-basket">
            @foreach ($catsOazis as $cat)
            <li data-id="{{ $cat['id'] }}" class="js-constructor-cat const-content__block-basket-item">
                <span><img src="{{ $cat['img'] }}" style="max-width:100%" alt="img"></span>
                <p>{{ $cat['name'] }}</p>
            </li>
            @endforeach
            @foreach ($catsSub as $cat)
            <li data-id="{{ $cat['id'] }}" class="js-constructor-cat const-content__block-basket-item">
                <span><img src="{{ $cat['img'] }}" style="max-width:100%" alt="img"></span>
                <p>{{ $cat['name'] }}</p>
            </li>
            @endforeach
        </ul>
    </div>
</div>

{{-- error login --}}
<div class="model-notice display-n" id="error-login-not">
    <div class="model-notice__block">
        <button class="model-notice__block-close"><svg width="19" height="19" viewBox="0 0 19 19" fill="none"
                xmlns="http://www.w3.org/2000/svg">
                <path d="M1 17.5L17.5 1" stroke="#AFB1BD" stroke-width="2"></path>
                <path d="M17.5 17.5L0.999999 1" stroke="#AFB1BD" stroke-width="2"></path>
            </svg>
        </button>
        <div class="model-notice__block-icons"><svg id="Capa_1" enable-background="new 0 0 512 512" height="512"
                viewBox="0 0 512 512" width="512" fill="#16B8C3" xmlns="http://www.w3.org/2000/svg">
                <g>
                    <path
                        d="m411 262.862v-47.862c0-69.822-46.411-129.001-110-148.33v-21.67c0-24.813-20.187-45-45-45s-45 20.187-45 45v21.67c-63.59 19.329-110 78.507-110 148.33v47.862c0 61.332-23.378 119.488-65.827 163.756-4.16 4.338-5.329 10.739-2.971 16.267s7.788 9.115 13.798 9.115h136.509c6.968 34.192 37.272 60 73.491 60 36.22 0 66.522-25.808 73.491-60h136.509c6.01 0 11.439-3.587 13.797-9.115s1.189-11.929-2.97-16.267c-42.449-44.268-65.827-102.425-65.827-163.756zm-170-217.862c0-8.271 6.729-15 15-15s15 6.729 15 15v15.728c-4.937-.476-9.94-.728-15-.728s-10.063.252-15 .728zm15 437c-19.555 0-36.228-12.541-42.42-30h84.84c-6.192 17.459-22.865 30-42.42 30zm-177.67-60c34.161-45.792 52.67-101.208 52.67-159.138v-47.862c0-68.925 56.075-125 125-125s125 56.075 125 125v47.862c0 57.93 18.509 113.346 52.671 159.138z">
                    </path>
                    <path
                        d="m451 215c0 8.284 6.716 15 15 15s15-6.716 15-15c0-60.1-23.404-116.603-65.901-159.1-5.857-5.857-15.355-5.858-21.213 0s-5.858 15.355 0 21.213c36.831 36.831 57.114 85.8 57.114 137.887z">
                    </path>
                    <path
                        d="m46 230c8.284 0 15-6.716 15-15 0-52.086 20.284-101.055 57.114-137.886 5.858-5.858 5.858-15.355 0-21.213-5.857-5.858-15.355-5.858-21.213 0-42.497 42.497-65.901 98.999-65.901 159.099 0 8.284 6.716 15 15 15z">
                    </path>
                </g>
            </svg></div>
        <div class="model-notice__block-text">
            <div class="model-notice__block-text-title">Вы должны войти на сайт!</div>
        </div>
    </div>
</div>
{{-- End --}}
<form action="" method="POST" id="forma">@csrf</form>

@endsection

@section('custom-js')
<script>
    $(function () {
        function submit_form(){
            
        }
        
        var constr = {
            items: {},
            addItem: function(id, size, color, count, $img, price, name) {
                count = Number(count);
                if (typeof(constr.items[id+'_'+size+'_'+color]) == 'undefined') {
                    constr.items[id+'_'+size+'_'+color] = {
                        count: count,
                        img: $img.eq(0).attr('src'),
                        price: price,
                        name: name
                    };
                } else {
                    constr.items[id+'_'+size+'_'+color].count += count;
                }
                constr.moveImg($img.eq(0));
                constr.exec();
            },
            moveImg: function($el) {
                var $cEl = $el.clone();
                $('body').append($cEl);
                $cEl.css({
                    position: 'absolute',
                    top: $el.offset().top,
                    left: $el.offset().left,
                    width: $el.width(),
                    height: $el.height(),
                    zIndex: 10000
                }).animate({
                    width: $cEl.width()+100,
                    height: $cEl.height()+100,
                    top: $el.offset().top-50,
                    left: $el.offset().left-50
                }, 'slow', function(){
                    var $l = $('#listConstructorBlock');
                    $cEl.animate({
                        top: $l.offset().top + ($l.height() / 2),
                        left: $l.offset().left + ($l.width() / 2),
                        width: 0,
                        height: 0
                    }, 'slow', function(){
                        $cEl.remove();
                    });
                });
            },
            exec: function(){
                localStorage.setItem('constrItems', JSON.stringify(constr.items));
                
                var $imgsWrap = $('#listConstructorBlock'),
                $elsWrap = $('#listConstructorElementPay'),
                $imgs = $imgsWrap.find('>li').addClass('m-active'),
                $els = $elsWrap.find('>div').addClass('m-active'),
                totalCount = 0,
                totalPrice = 0;

                for(var k in constr.items) {
                    // Генерируем карту
                    var i = 1;
                    while(i <= constr.items[k].count) {
                        if (!$imgs.filter('.'+k+'_'+i).removeClass('m-active').length) {
                            $imgsWrap.append('<li class="const-content__block-banner-map-item '+k+'_'+i+'"><img src="'+constr.items[k].img+'"></li>');
                        }
                        i++;
                    }
                    
                    // Гененируем итемы
                    if ($els.filter('.id-'+k).removeClass('m-active').length) {
                        $els.filter('.id-'+k).find('.const-content__swipers-list-count-sum').text(
                            constr.items[k].count
                        ).end().find('.const-content__swipers-list-price').text(
                            (constr.items[k].count * constr.items[k].price)+'₽'
                        );
                    } else {
                        var html = '<div data-k="'+k+'" class="swiper-slide id-'+k+'">';
                        html += '<div class="const-content__swipers-list-item" style="background-image: url('+constr.items[k].img+')">';
                        html += '<button class="const-content__swipers-list-close">';
                        html += '<svg width="63" height="63" viewBox="0 0 63 63" fill="none" xmlns="http://www.w3.org/2000/svg">';
                        html += '<path d="M22.3281 22.3296L40.2735 40.275" stroke="white" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>';
                        html += '<path d="M22.1313 40.4727L40.4712 22.1328" stroke="white" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>';
                        html += '</svg>';
                        html += '</button>';
                        html += '<div class="const-content__swipers-list-block">';
                        html += '<div class="const-content__swipers-list-text">'+constr.items[k].name+'</div>';
                        html += '<div class="const-content__swipers-list-count">';
                        html += '<div class="const-content__swipers-list-count-minus">';
                        html += '<svg width="11" height="2" viewBox="0 0 11 2" fill="none" xmlns="http://www.w3.org/2000/svg">';
                        html += '<path d="M1 1H9.34615" stroke="white" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>';
                        html += '</svg>';
                        html += '</div>';
                        html += '<div class="const-content__swipers-list-count-sum">'+constr.items[k].count+'</div>';
                        html += '<div class="const-content__swipers-list-count-plus">';
                        html += '<svg width="15" height="15" viewBox="0 0 15 15" fill="none" xmlns="http://www.w3.org/2000/svg">';
                        html += '<path d="M7.69238 3.41699V11.5837" stroke="white" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>';
                        html += '<path d="M3.51855 7.5H11.8647" stroke="white" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"></path>';
                        html += '</svg>';
                        html += '</div>';
                        html += '</div>';
                        html += '<div class="const-content__swipers-list-price">'+(constr.items[k].count * constr.items[k].price)+'₽</div>';
                        html += '</div>';
                        html += '</div>';
                        html += '</div>';
                        $elsWrap.append(html);
                    }
                    totalCount += constr.items[k].count;
                    totalPrice += constr.items[k].count * constr.items[k].price;
                }
                $imgsWrap.find('>.m-active').remove();
                $elsWrap.find('>.m-active').remove();

                // Считаем итого
                $('.const-content__swipers .const-content__swipers-bay-price-sum').text(
                    totalPrice+'₽'
                );
                $('.const-content__swipers .const-content__swipers-bay-price-counts').text(
                    totalCount
                );
                
                if (totalCount == 0) {
                    $('.const-content__swipe').addClass('display-n');
                    $('.const-content__swipers').addClass('display-n');
                } else {
                    $('.const-content__swipe').removeClass('display-n');
                }
                constr.drawImgs();
            },
            drawImgs: function(){
                // Ширина блока
                // Количество элементов
                // Нужно вычислить: Размеры элемента + позиции элементов
                var $imgsWrap = $('#listConstructorBlock'),
                $items = $imgsWrap.find('>li'),
                w = $imgsWrap.width(),
                h = $imgsWrap.height(),
                sw = w / 2,
                c = $items.length -1;
                
                var i = 1, z = 1, e = 0;
                while(i <= c) {
                    e++;
                    if (z == e) {
                        z++;
                        e = 1;
                    }
                    i++;
                }
                var lastRow = z - 1;
                var size = Math.ceil(w / lastRow);
                if (size > 128) size = 128;
                var bottom = 0, inRow = 1;
                $items.each(function(i){
                    var left = 0;
                    var sSize = lastRow % 2 == 1 ? size / 2 : size;
                    if (lastRow == 1) {
                        left = sw - sSize;
                    } else if (lastRow == 2) {
                        if (inRow == 1) {
                            left = sw - size;
                        } else {
                            left = sw;
                        }
                    } else {
                        if (lastRow % 2 == 1) {
                            if (inRow == Math.ceil(lastRow / 2)) {
                                left = sw - sSize;
                            } else if (inRow < Math.ceil(lastRow / 2)) {
                                left = sw - sSize - (size * (Math.ceil(lastRow / 2) - inRow));
                            } else {
                                left = sw + sSize + (size * (inRow - 1 - Math.ceil(lastRow / 2)));
                            }
                        } else {
                            if (inRow == lastRow / 2 + 1) {
                                left = sw;
                            } else if (inRow <= lastRow / 2) {
                                left = sw - sSize - (size * (lastRow / 2 - inRow));
                            } else {
                                left = sw + (size * (inRow - (lastRow / 2) - 1));
                            }
                            
                        }
                    }
                    $(this).css({
                        width: size,
                        height: size,
                        bottom: bottom,
                        left: left
                    });
                    if (inRow == lastRow) {
                        lastRow--;
                        inRow = 0;
                        bottom += size - (size / 100 * 30);
                    }
                    inRow++;
                    
                });
            },

// 1 = 50% - (size / 2)
// 2 = 50% - size | 50%
// 3 = 50% - size - (size / 2) | 50% - (size / 2) | 50% + (size / 2)
// 4 = 50% - (size * 2) | 50% - size | 50% | 50% + size
// 5 = 50% - (size * 2) - (size / 2) | 50% - size - (size / 2) | 50% - (size / 2) | 50% + size (size / 2) | 50% + (size * 2) + (size / 2)

            clickBuy: function(){

            },
            clickBasket: function(){

            },
            init: function(){
                $('.const-content__swipe').on('click', function(e){
                    e.preventDefault();
                    $('.const-content__swipers').removeClass('display-n');
                });

                $('#listConstructorElementPay')
                .on('click', '.const-content__swipers-list-close', function(e){
                    e.preventDefault();
                    e.stopPropagation();
                    delete constr.items[$(e.target).parents('.swiper-slide').data('k')];
                    constr.exec();
                }).on('click', '.const-content__swipers-list-count-minus', function(e){
                    e.preventDefault();
                    e.stopPropagation();
                    var val = Number($(e.target).parents('.swiper-slide').find('.const-content__swipers-list-count-sum').text());
                    val--;
                    if (val < 1) val = 1;
                    //$(e.target).parents('.swiper-slide').find('.const-content__swipers-list-count-sum').text(val)
                    constr.items[$(e.target).parents('.swiper-slide').data('k')].count = val;
                    constr.exec();
                }).on('click', '.const-content__swipers-list-count-plus', function(e){
                    e.preventDefault();
                    e.stopPropagation();
                    var val = Number($(e.target).parents('.swiper-slide').find('.const-content__swipers-list-count-sum').text());
                    val++;
                    //$(e.target).parents('.swiper-slide').find('.const-content__swipers-list-count-sum').text(val)
                    constr.items[$(e.target).parents('.swiper-slide').data('k')].count = val;
                    constr.exec();
                });

                $(window).on('resize', constr.drawImgs);

                if (localStorage.hasOwnProperty('constrItems')){
                    constr.items = JSON.parse(localStorage.getItem('constrItems'));
                    constr.exec();
                }
                
            }
        };

        constr.init();
        var waitRequest = false;
        $('.const-content__block-list, .const-content__block-basket').each(function(){
            var $parent = $(this),
            $li = $parent.find('li'),
            constListSliders_3;
            $li.on('click', function (e) {
                e.preventDefault();
                if (waitRequest) return;
                waitRequest = true;
                var $this = $(this);
                if ($this.hasClass('const-content__block-list-item-active')) {
                    // Закрываем
                    $this.removeClass('const-content__block-list-item-active');
                    if (constListSliders_3) {
                        constListSliders_3.destroy();
                    }
                    $parent.find('.js-items-constr').remove();
                    waitRequest = false;
                } else {
                    $parent.find('.js-items-constr').remove();
                    $li.removeClass('const-content__block-list-item-active');
                    $this.addClass('const-content__block-list-item-active');
                    // Открываем
                    $.get('/constructor/' + $this.data('id'), function (html) {
                        var index = $li.index($this);
                        var max = Math.floor($parent.width() / $li.eq(0).outerWidth(true));
                        do {
                            index++;
                        } while (index % max != 0);
                        index--;
                        if ($li.eq(index).length) {
                            $(html).insertAfter($li.eq(index));
                        } else {
                            $(html).appendTo($parent);
                        }

                        if (constListSliders_3) {
                            constListSliders_3.destroy();
                        }
                        constListSliders_3 = new Swiper($parent.find('.constListSlider-3')[0], {
                            slidesPerView: 1,
                            spaceBetween: 10,
                            navigation: {
                                nextEl: $parent.find('.constListSlider-3 .swiper-button-next')[0],
                                prevEl: $parent.find('.constListSlider-3 .swiper-button-prev')[0]
                            }
                        });
                        $parent.find('.constListSlider-3 .swiper-slide').each(function(){
                            changePrice($(this));
                        });

                        $([document.documentElement, document.body]).animate({
                            scrollTop: $parent.find('.js-items-constr').offset().top
                        }, 400);

                        waitRequest = false;
                    })
                }
            });

            var changePrice = function($slide){
                var $sizeLi = $slide.find('.const-content__block-sliders-1-content-info-circle li'),
                count = $slide.find('.const-content__block-sliders-1-content-info-description-count-sum').text(),
                $prices = $slide.find('.model-toy__block-info-prices > div');
                
                $prices.each(function(){
                    if($(this).data('num')) {
                        $(this).text((Number($(this).data('num')) * Number(count))+'₽')
                    }
                });

                if ($sizeLi.length != 0) {
                    $prices.addClass('display-n')
                    .filter('.sizeid-'+$sizeLi.filter('.m-active').data('id')).removeClass('display-n');
                }
            };

            $parent.on('click', '.const-content__block-slider-3-close', function(e){
                e.preventDefault();
                e.stopPropagation();
                console.log($parent.find('.const-content__block-list-item-active'));
                $parent.find('.const-content__block-list-item-active').trigger('click');
            }).on('click', '.js-btn', function(e){
                e.preventDefault();
                e.stopPropagation();
                var $target = $(e.target);
                if (!$target.hasClass('js-btn')) $target = $target.parent();
                constListSliders_3.slideTo($target.data('id'), 600);
            }).on('click', '.const-content__block-sliders-1-content-info-description-count-minus', function(e){
                e.preventDefault();
                e.stopPropagation();
                var $sum = $(e.target).parent().find('.const-content__block-sliders-1-content-info-description-count-sum'),
                sumVal = Number($sum.text());
                sumVal--;
                if (!sumVal || sumVal < 1) sumVal = 1;
                $sum.text(sumVal);
                changePrice($(e.target).parents('.swiper-slide'));
            }).on('click', '.const-content__block-sliders-1-content-info-description-count-plus', function(e){
                e.preventDefault();
                e.stopPropagation();
                var $sum = $(e.target).parent().find('.const-content__block-sliders-1-content-info-description-count-sum'),
                sumVal = Number($sum.text());
                sumVal++;
                if (!sumVal) sumVal = 1;
                $sum.text(sumVal);
                changePrice($(e.target).parents('.swiper-slide'));
            }).on('click', '.const-content__block-sliders-1-content-info-circle-item', function(e){
                e.preventDefault();
                e.stopPropagation();
                var $target = $(e.target);
                if (!$target.hasClass('const-content__block-sliders-1-content-info-circle-item')) $target = $target.parent();
                if (!$target.hasClass('m-active')) {
                    $target.parent().find('.m-active').removeClass('m-active');
                    $target.addClass('m-active');
                    changePrice($(e.target).parents('.swiper-slide'));
                }
            }).on('click', '.const-content__block-sliders-2-content-info-title-circle li', function(e){
                e.preventDefault();
                e.stopPropagation();
                var $target = $(e.target);
                if (!$target.hasClass('m-active')) {
                    $target.parent().find('.m-active').removeClass('m-active');
                    $target.addClass('m-active');
                }
            }).on('click', '.const-content__block-sliders-1-content-info-description-btn', function(e){
                e.preventDefault();
                e.stopPropagation();
                var $slide = $(e.target).parents('.swiper-slide'),
                $img = $slide.find('.const-content__block-slider-1-img img');
                if (!$img.length) {
                    var to = $slide.data('to');
                    var $img = $(e.target).parents('.constListSlider-3').find('.js-btn'+to+' img');
                }
                var name = $.trim($slide.find('.const-content__block-slider-1-info-title-item').text()),
                colorName = $slide.find('.const-content__block-sliders-2-content-info-title-circle .m-active').data('name');
                sizeName = $slide.find('.const-content__block-sliders-1-content-info-circle .m-active').text();
                
                if (colorName && sizeName) {
                    name += ' ('+$.trim(colorName)+', '+$.trim(sizeName)+')';
                } else if (colorName) {
                    name += ' ('+$.trim(colorName)+')';
                } else if (sizeName) {
                    name += ' ('+$.trim(sizeName)+')';
                }

                constr.addItem(
                    $slide.find('.const-content__block-sliders-1-content-info-description-btn').data('id'),
                    $slide.find('.const-content__block-sliders-1-content-info-circle .m-active').data('id'),
                    $slide.find('.const-content__block-sliders-2-content-info-title-circle .m-active').data('id'),
                    $slide.find('.const-content__block-sliders-1-content-info-description-count-sum').text(),
                    $img,
                    $slide.find('.model-toy__block-info-price-last:not(.display-n)').data('num'),
                    name
                );
            })
        })
    });

</script>
<style>
    .const-content__block-list,
    .const-content__block-basket {
        flex-wrap: wrap;
    }

    .const-content__block-list>li,
    .const-content__block-basket>li {
        margin-bottom: 60px;
    }

    .const-content__block-add {
        margin-top: 50px;
    }

    .const-content__block-basket-item span {
        height: 51px;
        width: 51px;
    }
    .js-items-constr { width: 100vw; margin-left: calc(-1 * (100vw - 1110px) / 2) }
    @media screen and (max-width: 1440px) {
        .js-items-constr { margin-left: -165px; }
    }
    .const-content__block-slider {
        width: 100%;
        height: 368px;
        position: relative;
        background: #000d32;
        padding: 0 165px;
        margin: 0 auto;
        display: -webkit-box;
        display: -ms-flexbox;
        display: flex;
        -webkit-box-align: center;
        -ms-flex-align: center;
        align-items: center;
        -webkit-box-pack: center;
        -ms-flex-pack: center;
        justify-content: center;
    }
    .const-content__block-slider-close {
        position: absolute;
        right: 175px; top: -19px; width: 38px;
        height: 38px;
        background: #001f75;
        display: -webkit-box;
        display: -ms-flexbox;
        display: flex;
        -webkit-box-align: center;
        -ms-flex-align: center;
        align-items: center;
        -webkit-box-pack: center;
        -ms-flex-pack: center;
        justify-content: center;
        border-radius: 50%;
        cursor: pointer;
    }
    .const-content__block-slider-3 { margin-top: 50px; }
    .const-content__block-slider-1-img { min-height: 100%; width: auto; min-width: 265px; margin-right:40px  }
    .const-content__block-slider-1-info-title { margin-bottom: 20px; }
    .const-content__block-slider-1-info-text-stock { margin: 0; }


    .const-content__block-sliders-1-content-info-circle { padding-bottom: 10px; position: relative;margin-top: 20px; width: 100%; justify-content:flex-end; flex-wrap: wrap;  flex-wrap: wrap; padding-top: 20px; margin: 0; width: 100%; }
    .const-content__block-sliders-2-content-info-title-circle { padding-bottom: 10px; margin-top: 20px; width: 100%; justify-content:flex-end; flex-wrap: wrap;  position: relative; flex-wrap: wrap; padding-top: 20px; margin: 0; width: 100%; }

    .const-content__block-sliders-1-content-info-circle:after { 
        right: 10px;
        left: auto;
        top: 0;
    }
    .const-content__block-sliders-2-content-info-title-circle:after {
        content: "Выберите цвет";
        position: absolute;
        top: 0;
        right: 10px;
        left: auto;
        font-family: Circe;
        font-style: normal;
        font-weight: 400;
        font-size: 10px;
        line-height: 100%;
        letter-spacing: .5px;
        color: #b6b3b3;
    }

    .const-content__block-sliders-1-content-info-circle > li { cursor: pointer; margin: 0 10px 10px 0;  width: 53px; height: 53px; border-radius: 50%; background-image: url(/constr/img/constr_circle_size.svg); background-size: cover; }
    .const-content__block-sliders-2-content-info-title-circle > li {cursor: pointer; margin: 0 10px 10px 0;  width: 30px; height: 30px; border-radius: 50%; background-image: url(/constr/img/constr_circle_color.svg); background-size: cover; }

    

    .const-content__block-slider-1-info-btn { flex-wrap: wrap; justify-content: space-evenly; }
    .const-btn { margin-top: 20px; }
    .const-content__block-slider-1-info-text-description-text {
        overflow: hidde ;
        max-height: 122px;
    }
    .const-content__block-slider-3 { height: auto;}
    .const-content__block-slider-1-content { padding: 20px 0;}
    .const-content__block-slider-1-content { align-items: center; }
    .const-content__block-slider-1-info-text-description-car { position: relative; top: 0; }
    .const-content__block-slider-1-info-text-description-list { position: relative; top: 0; }
    .const-content__block-slider-1-info-text { margin: 0; }

    .const-content__block-list-item-active { border: 3px solid #16b8c3 !important; }
    /*  */

    .const-content__block-sliders-2-content-info-title-circle > li { opacity: 0.5; transition: opacity linear .4s; cursor: pointer; }
    .const-content__block-sliders-1-content-info-circle > li { opacity: 0.5; transition: opacity linear .4s; cursor: pointer; }
    .const-content__block-sliders-2-content-info-title-circle > li.m-active { opacity: 1; }
    .const-content__block-sliders-1-content-info-circle > li.m-active { opacity: 1; }
    .const-content__block-sliders-2-content-info-title-circle > li:hover { opacity: 1; }
    .const-content__block-sliders-1-content-info-circle > li:hover { opacity: 1; }
    .swiper-wrapper.m-spec .const-content__block-sliders-1-content { padding-left: 320px; padding-top: 20px; }
    .const-content__block-sliders-1-content-img { position: absolute; top: 0; left: 0; z-index: 199 }
    .swiper-spec-wrap { position: relative; width: 1100px; margin: auto; }
    .const-content__block-slider-3 { height: auto !important }
    .constListSlider-3.m-pad { padding: 30px 5px !important; }
    .const-content__block-sliders-1-content > .row { width: 100% }
    .const-content__block-sliders-1-content .const-content__block-slider-1-info-text { flex-wrap: wrap; }
    .const-content__block-sliders-1-content .const-content__block-slider-1-info-text > div { position: static; padding-top: 10px; }
    .swiper-wrapper.m-spec .const-content__block-slider-1-info-btn { justify-content: flex-end;}
    .swiper-wrapper.m-spec .const-btn button { margin: 0 !important; }
    .const-content__block-basket svg { width: auto; height: auto; }
    .const-content__block-sliders-1-content-img-box, .const-content__block-sliders-1-content-img-basket,
    .const-content__block-sliders-1-content-img-container, .const-content__block-sliders-1-content-img-cylinder,
    .const-content__block-sliders-1-content-img-heart { cursor: pointer; }

    .const-content__block-banner-map { position: relative; width: 100%; height: 100%; padding: 20px; overflow: hidden; display: flex; justify-content: center; align-items: flex-end; }
    .const-content__block-banner-map-item { position: absolute; display: flex; justify-content: center; align-items: center; }
    .const-content__block-banner-map-item img { width: 95%; object-fit: contain; }
    .const-content__swipers-list-item { background-position: center; background-repeat: no-repeat; background-size: cover; }
    .const-content__swipers-list-block { bottom: auto; top: 100%; margin-top: 10px; }
    .const-content__swipers-list .swiper-slide { height: 300px; }

    .const-content__block-slider-3-close { z-index: 10000; }
</style>
@endsection